lib/tasks/dev/prime.rake

    task prime: 'db:setup' do
      include FactoryBot::Syntax::Methods

      15.times do
        profile = %i[admin client].sample
        create(:user, profile: profile)
      end

      system_requirements = []
      %w[Basic Intermediate Advanced].each do |sr_name|
        system_requirements << create(:system_requirement, name: sr_name)
      end

      15.times do
        coupon_status = %i[active inactive].sample
        create(:coupon, status: coupon_status)
      end

      categories = []
      25.times do
        categories << create(:category, name: Faker::Game.unique.genre)
      end

      30.times do
        game_name = Faker::Game.unique.title
        availability = %i[available unavailable].sample
        categories_count = rand(0..3)
        featured = [true, false].sample
        release_date = (0..15).to_a.sample.days.ago
        game_categories_ids = []
        categories_count.times { game_categories_ids << Category.all.sample.id }
---
INSERT INTO "system_requirements" ("name", "operational_system", "storage", "processor", "memory", "video_board", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tactical role-playing"], ["created_at", "2023-06-10 23:05:19.221627"], ["updated_at", "2023-06-10 23:05:19.221627"]]
INSERT INTO "games" ("mode", "release_date", "developer", "system_requirement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "categories".* FROM "categories"

      end

      50.times do
        game = Game.all[0...5].sample
---
SELECT "games".* FROM "games"

      10.times do
        product = Product.all.sample
        (1..10).to_a.sample.times do
          product.wish_items.create(user: User.all.sample)
---
INSERT INTO "products" ("name", "description", "price", "productable_type", "productable_id", "created_at", "updated_at", "status", "featured") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"